Reports/ОтчетКонструктора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетКонструктора</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтадииКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтадииКомплекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВторойУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПервыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТретийУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЧетвертыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыврдитьЧетвертыйВместоТретьего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченныйПоказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеЭтапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетКонструктора/Ext/ManagerModule.bsl
Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|	И НЕ ЕСТЬNULL(ТаймингЗадач.Задача.ОбобщеннаяЗадача, ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойН,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойК,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	(ТаймингЗадач.Исполнитель В (&Исполнитель)
		|			ИЛИ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором))
		|	И НЕ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПриостановкаКонструктором)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", Новый ТаблицаЗначений);
	ТайминЗадач = Запрос.Выполнить().Выгрузить();
	
	ТайминЗадач.Колонки.Добавить("ДатаОкончания", 	Новый ОписаниеТипов("Дата"));
	ТайминЗадач.Колонки.Добавить("ПКД", 			Новый ОписаниеТипов("Булево"));

	ЗадачиКонструктора = Новый Массив;

	ИсполнительЭтоМассив = ТипЗнч(Исполнитель) = Тип("Массив");
	
	Для каждого х Из ТайминЗадач Цикл
		
		Если ИсполнительЭтоМассив Тогда
		
			ВСписке = НЕ Исполнитель.Найти(х.Исполнитель) = Неопределено;
		
		Иначе
		
			ВСписке = х.Исполнитель = Исполнитель;
		
		КонецЕсли;
	
		Если ВСписке Тогда
		
			Если ЗадачиКонструктора.Найти(х.Задача)  = Неопределено Тогда
			
				ЗадачиКонструктора.Добавить(х.Задача);	
			
			КонецЕсли;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	МассивДляУдаления 	= Новый Массив;
	МассивПКД 			= Новый Массив;
	
	ТипЗадачиПКД = Тип("ЗадачаСсылка.Задачи_ПКД");
	
	
	Для каждого х Из ТайминЗадач Цикл
		
		Если ЗадачиКонструктора.Найти(х.Задача) = Неопределено Тогда
			
			МассивДляУдаления.Добавить(х);
			
		Иначе
			
			х.ПКД = ТипЗнч(х.Задача) = ТипЗадачиПКД;
			
		КонецЕсли;	
	
	КонецЦикла;
	
	
	Для каждого х Из МассивДляУдаления Цикл
	
		ТайминЗадач.Удалить(х);	
	
	КонецЦикла;
	
	СтруктураВозврата.ТайминЗадач = ТайминЗадач.СкопироватьКолонки();
	
	МаксимальныйИндекс = ТайминЗадач.Количество() - 1;
	
	СтрокаНачалоработы = 0;
	Работа = Ложь;
	ПКД = Ложь;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = ТайминЗадач[х];
		

		Если НЕ Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора Тогда
			
			Работа = Истина;
			СтрокаНачалоработы = х;
			ПКД = СтрокаТайминга.ПКД;
			
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора 
			И ПКД = СтрокаТайминга.ПКД Тогда
			Продолжить;	
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором 
			И ПКД = СтрокаТайминга.ПКД Тогда
			
			НС = СтруктураВозврата.ТайминЗадач.Добавить();	
			ЗаполнитьЗначенияСвойств(НС,  ТайминЗадач[СтрокаНачалоработы]);
			НС.ДатаОкончания	 = СтрокаТайминга.ДатаНачала;
			Работа = Ложь;
		Иначе
			Работа = Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()


Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
		СтрокаТайминга.ДатаСтрокойН = Формат(СтрокаТайминга.ДатаНачала, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаНачала, "ДФ=HH:mm");
		СтрокаТайминга.ДатаСтрокойК = Формат(СтрокаТайминга.ДатаОкончания, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаОкончания, "ДФ=HH:mm");
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
